# coding=GBK
# 加1
'''
给定一个由整数组成的非空数组所表示的非负整数，在该数的基础上加一。

最高位数字存放在数组的首位， 数组中每个元素只存储一个数字。

你可以假设除了整数 0 之外，这个整数不会以零开头。

999 + 1 = 1000
89 + 1 = 90
109 + 1 = 110
1 + 1 = 2
'''
def solve18(p):
	end = len(p) - 1
	p[end] += 1
	i= 0
	if p[end] > 9:
		p[end] = 0

		i = end - 1
		p[i] += 1
		while i >= 0 and p[i] > 9:
			p[i] = 0
			i -= 1
			if i >= 0:
				p[i] += 1
	if i < 0:
		p = [0]*(end + 2)
		p[0] = 1
	print(p)

datas = [[9,9,9], [8, 8], [1,0, 9], [1], [1,2,3,9], [2,5,3,4]]
for d in datas:
	solve18(d)


  